app/views/games/_deck_fields.html.erb

<p>
    <%= f.select :game_id, Game.all.map {|a| [a.name, a.id]}, :prompt=>"--Choose an deck--" %>
---
SELECT "games".* FROM "games"