app/views/games/assign_player.html.erb

    <%= f.label :player %>
    <%= f.select :player_id, Player.all.map { |a| [a.name, a.id] }, :prompt => "--Choose a player--" %>
---
SELECT "players".* FROM "players"