app/views/games/index.html.erb

          <% if game.player_id? %>
              <%= Player.find(game.player_id).name %>
---
SELECT "players".* FROM "players" WHERE "players"."id" = ? LIMIT 1  [["id", 1]]