app/views/games/index.html.erb

SELECT "players".* FROM "players" INNER JOIN "games_players" ON "players"."id" = "games_players"."player_id" WHERE "games_players"."game_id" = 18
SELECT COUNT(*) FROM "players" INNER JOIN "games_players" ON "players"."id" = "games_players"."player_id" WHERE "games_players"."game_id" = 28
---
        <td>
          <% if !game.players.empty? %>