app/views/games/show.html.erb

  <b>Players:</b>   </p>
  <% @game.players.each do |p| %>
---
SELECT "players".* FROM "players" INNER JOIN "games_players" ON "players"."id" = "games_players"."player_id" WHERE "games_players"."game_id" = 24