app/views/players/_form.html.erb

SELECT "games".* FROM "games"
---
      <%= f.label :game_name %><br />
      <%= f.select :game_id, Game.all.map { |a| [a.name, a.id] }, :prompt => "--Choose a game--" %>