app/controllers/decks_controller.rb

  def create
    @deck = Deck.new(params[:deck])
    respond_to do |format|
      if @deck.save
---
INSERT INTO "decks" ("card_id", "count", "created_at", "game_id", "trump_card_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["card_id", nil], ["count", nil], ["created_at", Wed, 13 Feb 2013 16:00:29 UTC +00:00], ["game_id", nil], ["trump_card_id", nil], ["updated_at", Wed, 13 Feb 2013 16:00:29 UTC +00:00]]

  def show
    @deck = Deck.find(params[:id])
---
SELECT "decks".* FROM "decks" WHERE "decks"."id" = ? LIMIT 1  [["id", "2"]]

  def destroy
    @deck = Deck.find(params[:id])
    @deck.destroy
---
SELECT "decks".* FROM "decks" WHERE "decks"."id" = ? LIMIT 1  [["id", "57"]]
DELETE FROM "decks" WHERE "decks"."id" = ?  [["id", 57]]