app/controllers/games_controller.rb

SELECT "games".* FROM "games" WHERE "games"."id" = ? LIMIT 1  [["id", "1"]]
---
  def assign_player

      @game = Game.find(params[:id])