app/controllers/game_logic_controller.rb

  def start
    @game = Game.find(params[:id])
    respond_to do |format|
      if !@game.players.empty?
---
SELECT "games".* FROM "games" WHERE "games"."id" = ? LIMIT 1  [["id", "18"]]
SELECT "players".* FROM "players" INNER JOIN "games_players" ON "players"."id" = "games_players"."player_id" WHERE "games_players"."game_id" = 19