app/controllers/games_controller.rb

  def create
    @game = Game.new(params[:game])
    @game.players.each do |p|
      p.has_cards = 0
    end
    respond_to do |format|
      if @game.save
---
SELECT "players".* FROM "players" WHERE "players"."game_id" = 26
INSERT INTO "games" ("created_at", "game_date", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Thu, 07 Feb 2013 13:00:34 UTC +00:00], ["game_date", nil], ["name", "First Game"], ["updated_at", Thu, 07 Feb 2013 13:00:34 UTC +00:00]]
INSERT INTO "players" ("created_at", "game_id", "has_cards", "name", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Mon, 18 Feb 2013 11:21:38 UTC +00:00], ["game_id", 10], ["has_cards", nil], ["name", "Philips"], ["updated_at", Mon, 18 Feb 2013 11:21:38 UTC +00:00]]

  def update
    @game = Game.find(params[:id])
    @game.players.each do |p|
      p.has_cards = 0
    end
    respond_to do |format|
      if @game.update_attributes(params[:game])
---
SELECT "games".* FROM "games" WHERE "games"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "players".* FROM "players" INNER JOIN "games_players" ON "players"."id" = "games_players"."player_id" WHERE "games_players"."game_id" = 18
UPDATE "games" SET "name" = 'First Game222', "game_date" = '2013-02-06 22:00:00.000000', "updated_at" = '2013-02-07 13:51:14.163813' WHERE "games"."id" = 1
UPDATE "players" SET "has_cards" = 'f', "updated_at" = '2013-02-18 14:42:35.593700' WHERE "players"."id" = 36

  def destroy
    @game = Game.find(params[:id])
    @game.destroy
---
SELECT "games".* FROM "games" WHERE "games"."id" = ? LIMIT 1  [["id", "24"]]
DELETE FROM "games" WHERE "games"."id" = ?  [["id", 24]]