app/views/decks/index.html.erb

SELECT "cards".* FROM "cards" WHERE "cards"."deck_id" = 1
---
                <td align="center">
                  <%= image_tag "cards/"+card.suit + card.value + ".png" %>