app/views/decks/show.html.erb

SELECT "cards".* FROM "cards" WHERE "cards"."deck_id" = 2
---
        <td align="center">
          <%= image_tag "cards/" + card.suit + card.value + ".png" %>